node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 331
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 331
          }
        }
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_100.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_101.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_102.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_103.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_105.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_106.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_108.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_109.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_10.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_110.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_111.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_112.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_113.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_114.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_116.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_117.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_118.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_11.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_120.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_121.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_122.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_124.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_125.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_126.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_12.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_130.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_131.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_132.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_133.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_134.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_135.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_136.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_137.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_138.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_13.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_15.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_16.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_17.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_18.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_19.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_1.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_20.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_21.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_22.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_23.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_24.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_25.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_26.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_27.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_28.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_29.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_2.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_33.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_34.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_36.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_38.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_39.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_3.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_40.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_41.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_43.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_44.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_46.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_47.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_48.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_49.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_50.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_51.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_53.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_54.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_55.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_56.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_57.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_58.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_59.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_5.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_60.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_61.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_62.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_63.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_65.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_66.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_68.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_69.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_72.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_73.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_75.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_76.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_77.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_78.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_7.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_80.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_81.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_82.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_83.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_84.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_85.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_86.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_87.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_88.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_89.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_8.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_90.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_91.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_92.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_93.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_95.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_96.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_98.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_99.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_12_AP_k_9.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_100.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_101.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_102.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_104.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_105.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_106.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_107.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_108.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_10.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_112.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_113.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_114.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_116.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_117.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_118.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_119.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_120.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_121.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_122.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_123.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_124.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_125.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_126.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_127.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_128.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_12.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_130.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_131.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_132.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_133.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_134.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_136.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_138.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_13.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_14.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_15.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_16.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_19.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_1.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_20.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_21.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_22.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_23.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_25.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_27.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_28.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_29.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_2.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_30.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_32.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_33.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_34.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_36.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_37.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_38.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_39.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_3.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_41.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_42.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_44.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_46.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_47.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_48.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_49.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_4.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_50.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_51.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_53.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_54.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_55.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_57.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_58.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_59.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_5.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_60.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_63.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_64.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_66.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_67.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_69.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_6.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_70.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_72.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_73.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_74.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_75.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_76.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_77.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_78.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_7.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_80.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_81.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_82.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_84.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_85.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_86.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_87.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_89.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_8.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_90.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_91.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_92.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_93.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_94.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_95.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_96.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_97.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_98.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_99.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_15_AP_k_9.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_100.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_103.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_104.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_105.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_106.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_108.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_109.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_10.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_110.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_111.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_112.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_113.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_114.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_115.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_116.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_11.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_121.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_122.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_123.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_124.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_125.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_126.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_128.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_129.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_12.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_130.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_131.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_132.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_133.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_134.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_135.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_136.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_137.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_14.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_16.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_17.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_18.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_19.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_1.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_20.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_22.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_23.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_27.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_29.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_2.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_30.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_31.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_32.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_33.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_34.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_35.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_36.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_38.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_3.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_40.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_41.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_42.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_43.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_44.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_47.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_49.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_4.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_50.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_51.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_52.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_53.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_54.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_55.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_56.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_57.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_58.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_59.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_5.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_60.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_63.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_64.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_65.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_66.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_68.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_69.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_6.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_70.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_73.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_74.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_75.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_76.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_77.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_78.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_79.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_7.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_80.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_81.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_82.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_84.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_85.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_86.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_87.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_88.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_8.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_90.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_91.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_92.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_93.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_94.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_95.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_96.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_97.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_98.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_99.tfrecords"
        string_val: "./nsfnet/50_nodes_route/tfrecords/train/results_synth50_9_AP_k_9.tfrecords"
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 331
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "cycle_length"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 4
      }
    }
  }
}
node {
  name: "block_length"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "sloppy"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "buffer_output_elements"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 2
      }
    }
  }
}
node {
  name: "prefetch_input_elements"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 8
      }
    }
  }
}
node {
  name: "buffer_size_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 10000
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "seed_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "num_parallel_calls"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 32
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 1
          }
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Const_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Const_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Const_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 1
          }
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "Const_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 1
          }
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "Const_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 1
          }
        }
        int64_val: 2450
      }
    }
  }
}
node {
  name: "Const_7"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 1
          }
        }
        int64_val: 2450
      }
    }
  }
}
node {
  name: "padding_value"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "padding_value_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "padding_value_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "padding_value_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "padding_value_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "padding_value_5"
